class TestData:
    """Класс с тестовыми данными"""
    
    ORDER_DATA = [
        {
            "name": "Иван",
            "surname": "Петров",
            "address": "ул. Ленина, 10",
            "metro": "Сокольники",
            "phone": "+79991234567",
            "date": "01.04.2026",
            "rental_period": "сутки",
            "color": "чёрный жемчуг",
            "comment": "Позвонить за час"
        },
        {
            "name": "Мария",
            "surname": "Иванова",
            "address": "пр. Мира, 25",
            "metro": "Преображенская площадь",
            "phone": "+79876543210",
            "date": "05.04.2026",
            "rental_period": "трое суток",
            "color": "серая безысходность",
            "comment": "Домофон 123"
        }
    ]
    
    FAQ_DATA = [
        {"question": "Сколько это стоит?",
         "answer": "Сутки — 400 рублей. Оплата курьеру — наличными или картой."},
        {"question": "Хочу сразу несколько самокатов!",
         "answer": "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."},
        {"question": "Как рассчитывается время аренды?",
         "answer": "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."},
        {"question": "Можно ли продлить заказ?",
         "answer": "Только начиная с завтрашнего дня. Но скоро станем расторопнее."},
        {"question": "Вы привозите зарядку вместе с самокатом?",
         "answer": "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."},
        {"question": "Можно ли отменить заказ?",
         "answer": "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."},
        {"question": "Я живу за МКАДом, привезёте?",
         "answer": "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."},
        {"question": "А если я найду самокат дешевле?",
         "answer": "Да, обязательно. Всем самокатов! И Москве, и Московской области."}
    ]
